mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xl/common/s6e2c2xl.h
/*******************************************************************************
* DUALFLASH_IF_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t DFASZR;
        stc_dualflash_if_dfaszr_field_t DFASZR_f;
        struct {
          union {
            __IO uint16_t DFASZRL;
            struct {
              __IO uint8_t DFASZRLL;
              __IO uint8_t DFASZRLH;
            };
          };
          union {
            __IO uint16_t DFASZRH;
            struct {
              __IO uint8_t DFASZRHL;
              __IO uint8_t DFASZRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t DFRWTR;
        stc_dualflash_if_dfrwtr_field_t DFRWTR_f;
        struct {
          union {
            __IO uint16_t DFRWTRL;
            struct {
              __IO uint8_t DFRWTRLL;
              __IO uint8_t DFRWTRLH;
            };
          };
          union {
            __IO uint16_t DFRWTRH;
            struct {
              __IO uint8_t DFRWTRHL;
              __IO uint8_t DFRWTRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t DFSTR;
        stc_dualflash_if_dfstr_field_t DFSTR_f;
        struct {
          union {
            __IO uint16_t DFSTRL;
            struct {
              __IO uint8_t DFSTRLL;
              __IO uint8_t DFSTRLH;
            };
          };
          union {
            __IO uint16_t DFSTRH;
            struct {
              __IO uint8_t DFSTRHL;
              __IO uint8_t DFSTRHH;
            };
          };
        };
    };
} FM_DUALFLASH_IF_TypeDef, FM4_DUALFLASH_IF_TypeDef;

/*******************************************************************************
* ECC_CAPTURE_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t FERRAD;
        stc_ecc_capture_ferrad_field_t FERRAD_f;
        struct {
          union {
            __IO uint16_t FERRADL;
            struct {
              __IO uint8_t FERRADLL;
              __IO uint8_t FERRADLH;
            };
          };
          union {
            __IO uint16_t FERRADH;
            struct {
              __IO uint8_t FERRADHL;
              __IO uint8_t FERRADHH;
            };
          };
        };
    };
} FM_ECC_CAPTURE_TypeDef, FM4_ECC_CAPTURE_TypeDef;

/*******************************************************************************
* ETHERNET_CONTROL_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t ETH_MODE;
        stc_ethernet_control_eth_mode_field_t ETH_MODE_f;
        struct {
          union {
            __IO uint16_t ETH_MODEL;
            struct {
              __IO uint8_t ETH_MODELL;
              __IO uint8_t ETH_MODELH;
            };
          };
          union {
            __IO uint16_t ETH_MODEH;
            struct {
              __IO uint8_t ETH_MODEHL;
              __IO uint8_t ETH_MODEHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[4];
    union {
        __IO uint32_t ETH_CLKG;
        stc_ethernet_control_eth_clkg_field_t ETH_CLKG_f;
        struct {
          union {
            __IO uint16_t ETH_CLKGL;
            struct {
              __IO uint8_t ETH_CLKGLL;
              __IO uint8_t ETH_CLKGLH;
            };
          };
          union {
            __IO uint16_t ETH_CLKGH;
            struct {
              __IO uint8_t ETH_CLKGHL;
              __IO uint8_t ETH_CLKGHH;
            };
          };
        };
    };
} FM_ETHERNET_CONTROL_TypeDef, FM4_ETHERNET_CONTROL_TypeDef;

/*******************************************************************************
* ETHERNET_MAC_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t MCR;
        stc_ethernet_mac_mcr_field_t MCR_f;
        struct {
          union {
            __IO uint16_t MCRL;
            struct {
              __IO uint8_t MCRLL;
              __IO uint8_t MCRLH;
            };
          };
          union {
            __IO uint16_t MCRH;
            struct {
              __IO uint8_t MCRHL;
              __IO uint8_t MCRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MFFR;
        stc_ethernet_mac_mffr_field_t MFFR_f;
        struct {
          union {
            __IO uint16_t MFFRL;
            struct {
              __IO uint8_t MFFRLL;
              __IO uint8_t MFFRLH;
            };
          };
          union {
            __IO uint16_t MFFRH;
            struct {
              __IO uint8_t MFFRHL;
              __IO uint8_t MFFRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MHTRH;
        stc_ethernet_mac_mhtrh_field_t MHTRH_f;
        struct {
          union {
            __IO uint16_t MHTRHL;
            struct {
              __IO uint8_t MHTRHLL;
              __IO uint8_t MHTRHLH;
            };
          };
          union {
            __IO uint16_t MHTRHH;
            struct {
              __IO uint8_t MHTRHHL;
              __IO uint8_t MHTRHHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MHTRL;
        stc_ethernet_mac_mhtrl_field_t MHTRL_f;
        struct {
          union {
            __IO uint16_t MHTRLL;
            struct {
              __IO uint8_t MHTRLLL;
              __IO uint8_t MHTRLLH;
            };
          };
          union {
            __IO uint16_t MHTRLH;
            struct {
              __IO uint8_t MHTRLHL;
              __IO uint8_t MHTRLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t GAR;
        stc_ethernet_mac_gar_field_t GAR_f;
        struct {
          union {
            __IO uint16_t GARL;
            struct {
              __IO uint8_t GARLL;
              __IO uint8_t GARLH;
            };
          };
          union {
            __IO uint16_t GARH;
            struct {
              __IO uint8_t GARHL;
              __IO uint8_t GARHH;
            };
          };
        };
    };
    union {
        __IO uint32_t GDR;
        stc_ethernet_mac_gdr_field_t GDR_f;
        struct {
          union {
            __IO uint16_t GDRL;
            struct {
              __IO uint8_t GDRLL;
              __IO uint8_t GDRLH;
            };
          };
          union {
            __IO uint16_t GDRH;
            struct {
              __IO uint8_t GDRHL;
              __IO uint8_t GDRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FCR;
        stc_ethernet_mac_fcr_field_t FCR_f;
        struct {
          union {
            __IO uint16_t FCRL;
            struct {
              __IO uint8_t FCRLL;
              __IO uint8_t FCRLH;
            };
          };
          union {
            __IO uint16_t FCRH;
            struct {
              __IO uint8_t FCRHL;
              __IO uint8_t FCRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t VTR;
        stc_ethernet_mac_vtr_field_t VTR_f;
        struct {
          union {
            __IO uint16_t VTRL;
            struct {
              __IO uint8_t VTRLL;
              __IO uint8_t VTRLH;
            };
          };
          union {
            __IO uint16_t VTRH;
            struct {
              __IO uint8_t VTRHL;
              __IO uint8_t VTRHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[8];
    union {
        __IO uint32_t RWFFR;
        stc_ethernet_mac_rwffr_field_t RWFFR_f;
        struct {
          union {
            __IO uint16_t RWFFRL;
            struct {
              __IO uint8_t RWFFRLL;
              __IO uint8_t RWFFRLH;
            };
          };
          union {
            __IO uint16_t RWFFRH;
            struct {
              __IO uint8_t RWFFRHL;
              __IO uint8_t RWFFRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PMTR;
        stc_ethernet_mac_pmtr_field_t PMTR_f;
        struct {
          union {
            __IO uint16_t PMTRL;
            struct {
              __IO uint8_t PMTRLL;
              __IO uint8_t PMTRLH;
            };
          };
          union {
            __IO uint16_t PMTRH;
            struct {
              __IO uint8_t PMTRHL;
              __IO uint8_t PMTRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t LPICSR;
        stc_ethernet_mac_lpicsr_field_t LPICSR_f;
        struct {
          union {
            __IO uint16_t LPICSRL;
            struct {
              __IO uint8_t LPICSRLL;
              __IO uint8_t LPICSRLH;
            };
          };
          union {
            __IO uint16_t LPICSRH;
            struct {
              __IO uint8_t LPICSRHL;
              __IO uint8_t LPICSRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t LPITCR;
        stc_ethernet_mac_lpitcr_field_t LPITCR_f;
        struct {
          union {
            __IO uint16_t LPITCRL;
            struct {
              __IO uint8_t LPITCRLL;
              __IO uint8_t LPITCRLH;
            };
          };
          union {
            __IO uint16_t LPITCRH;
            struct {
              __IO uint8_t LPITCRHL;
              __IO uint8_t LPITCRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t ISR;
        stc_ethernet_mac_isr_field_t ISR_f;
        struct {
          union {
            __IO uint16_t ISRL;
            struct {
              __IO uint8_t ISRLL;
              __IO uint8_t ISRLH;
            };
          };
          union {
            __IO uint16_t ISRH;
            struct {
              __IO uint8_t ISRHL;
              __IO uint8_t ISRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IMR;
        stc_ethernet_mac_imr_field_t IMR_f;
        struct {
          union {
            __IO uint16_t IMRL;
            struct {
              __IO uint8_t IMRLL;
              __IO uint8_t IMRLH;
            };
          };
          union {
            __IO uint16_t IMRH;
            struct {
              __IO uint8_t IMRHL;
              __IO uint8_t IMRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR0H;
        stc_ethernet_mac_mar0h_field_t MAR0H_f;
        struct {
          union {
            __IO uint16_t MAR0HL;
            struct {
              __IO uint8_t MAR0HLL;
              __IO uint8_t MAR0HLH;
            };
          };
          union {
            __IO uint16_t MAR0HH;
            struct {
              __IO uint8_t MAR0HHL;
              __IO uint8_t MAR0HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR0L;
        stc_ethernet_mac_mar0l_field_t MAR0L_f;
        struct {
          union {
            __IO uint16_t MAR0LL;
            struct {
              __IO uint8_t MAR0LLL;
              __IO uint8_t MAR0LLH;
            };
          };
          union {
            __IO uint16_t MAR0LH;
            struct {
              __IO uint8_t MAR0LHL;
              __IO uint8_t MAR0LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR1H;
        stc_ethernet_mac_mar1h_field_t MAR1H_f;
        struct {
          union {
            __IO uint16_t MAR1HL;
            struct {
              __IO uint8_t MAR1HLL;
              __IO uint8_t MAR1HLH;
            };
          };
          union {
            __IO uint16_t MAR1HH;
            struct {
              __IO uint8_t MAR1HHL;
              __IO uint8_t MAR1HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR1L;
        stc_ethernet_mac_mar1l_field_t MAR1L_f;
        struct {
          union {
            __IO uint16_t MAR1LL;
            struct {
              __IO uint8_t MAR1LLL;
              __IO uint8_t MAR1LLH;
            };
          };
          union {
            __IO uint16_t MAR1LH;
            struct {
              __IO uint8_t MAR1LHL;
              __IO uint8_t MAR1LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR2H;
        stc_ethernet_mac_mar2h_field_t MAR2H_f;
        struct {
          union {
            __IO uint16_t MAR2HL;
            struct {
              __IO uint8_t MAR2HLL;
              __IO uint8_t MAR2HLH;
            };
          };
          union {
            __IO uint16_t MAR2HH;
            struct {
              __IO uint8_t MAR2HHL;
              __IO uint8_t MAR2HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR2L;
        stc_ethernet_mac_mar2l_field_t MAR2L_f;
        struct {
          union {
            __IO uint16_t MAR2LL;
            struct {
              __IO uint8_t MAR2LLL;
              __IO uint8_t MAR2LLH;
            };
          };
          union {
            __IO uint16_t MAR2LH;
            struct {
              __IO uint8_t MAR2LHL;
              __IO uint8_t MAR2LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR3H;
        stc_ethernet_mac_mar3h_field_t MAR3H_f;
        struct {
          union {
            __IO uint16_t MAR3HL;
            struct {
              __IO uint8_t MAR3HLL;
              __IO uint8_t MAR3HLH;
            };
          };
          union {
            __IO uint16_t MAR3HH;
            struct {
              __IO uint8_t MAR3HHL;
              __IO uint8_t MAR3HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR3L;
        stc_ethernet_mac_mar3l_field_t MAR3L_f;
        struct {
          union {
            __IO uint16_t MAR3LL;
            struct {
              __IO uint8_t MAR3LLL;
              __IO uint8_t MAR3LLH;
            };
          };
          union {
            __IO uint16_t MAR3LH;
            struct {
              __IO uint8_t MAR3LHL;
              __IO uint8_t MAR3LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR4H;
        stc_ethernet_mac_mar4h_field_t MAR4H_f;
        struct {
          union {
            __IO uint16_t MAR4HL;
            struct {
              __IO uint8_t MAR4HLL;
              __IO uint8_t MAR4HLH;
            };
          };
          union {
            __IO uint16_t MAR4HH;
            struct {
              __IO uint8_t MAR4HHL;
              __IO uint8_t MAR4HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR4L;
        stc_ethernet_mac_mar4l_field_t MAR4L_f;
        struct {
          union {
            __IO uint16_t MAR4LL;
            struct {
              __IO uint8_t MAR4LLL;
              __IO uint8_t MAR4LLH;
            };
          };
          union {
            __IO uint16_t MAR4LH;
            struct {
              __IO uint8_t MAR4LHL;
              __IO uint8_t MAR4LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR5H;
        stc_ethernet_mac_mar5h_field_t MAR5H_f;
        struct {
          union {
            __IO uint16_t MAR5HL;
            struct {
              __IO uint8_t MAR5HLL;
              __IO uint8_t MAR5HLH;
            };
          };
          union {
            __IO uint16_t MAR5HH;
            struct {
              __IO uint8_t MAR5HHL;
              __IO uint8_t MAR5HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR5L;
        stc_ethernet_mac_mar5l_field_t MAR5L_f;
        struct {
          union {
            __IO uint16_t MAR5LL;
            struct {
              __IO uint8_t MAR5LLL;
              __IO uint8_t MAR5LLH;
            };
          };
          union {
            __IO uint16_t MAR5LH;
            struct {
              __IO uint8_t MAR5LHL;
              __IO uint8_t MAR5LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR6H;
        stc_ethernet_mac_mar6h_field_t MAR6H_f;
        struct {
          union {
            __IO uint16_t MAR6HL;
            struct {
              __IO uint8_t MAR6HLL;
              __IO uint8_t MAR6HLH;
            };
          };
          union {
            __IO uint16_t MAR6HH;
            struct {
              __IO uint8_t MAR6HHL;
              __IO uint8_t MAR6HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR6L;
        stc_ethernet_mac_mar6l_field_t MAR6L_f;
        struct {
          union {
            __IO uint16_t MAR6LL;
            struct {
              __IO uint8_t MAR6LLL;
              __IO uint8_t MAR6LLH;
            };
          };
          union {
            __IO uint16_t MAR6LH;
            struct {
              __IO uint8_t MAR6LHL;
              __IO uint8_t MAR6LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR7H;
        stc_ethernet_mac_mar7h_field_t MAR7H_f;
        struct {
          union {
            __IO uint16_t MAR7HL;
            struct {
              __IO uint8_t MAR7HLL;
              __IO uint8_t MAR7HLH;
            };
          };
          union {
            __IO uint16_t MAR7HH;
            struct {
              __IO uint8_t MAR7HHL;
              __IO uint8_t MAR7HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR7L;
        stc_ethernet_mac_mar7l_field_t MAR7L_f;
        struct {
          union {
            __IO uint16_t MAR7LL;
            struct {
              __IO uint8_t MAR7LLL;
              __IO uint8_t MAR7LLH;
            };
          };
          union {
            __IO uint16_t MAR7LH;
            struct {
              __IO uint8_t MAR7LHL;
              __IO uint8_t MAR7LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR8H;
        stc_ethernet_mac_mar8h_field_t MAR8H_f;
        struct {
          union {
            __IO uint16_t MAR8HL;
            struct {
              __IO uint8_t MAR8HLL;
              __IO uint8_t MAR8HLH;
            };
          };
          union {
            __IO uint16_t MAR8HH;
            struct {
              __IO uint8_t MAR8HHL;
              __IO uint8_t MAR8HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR8L;
        stc_ethernet_mac_mar8l_field_t MAR8L_f;
        struct {
          union {
            __IO uint16_t MAR8LL;
            struct {
              __IO uint8_t MAR8LLL;
              __IO uint8_t MAR8LLH;
            };
          };
          union {
            __IO uint16_t MAR8LH;
            struct {
              __IO uint8_t MAR8LHL;
              __IO uint8_t MAR8LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR9H;
        stc_ethernet_mac_mar9h_field_t MAR9H_f;
        struct {
          union {
            __IO uint16_t MAR9HL;
            struct {
              __IO uint8_t MAR9HLL;
              __IO uint8_t MAR9HLH;
            };
          };
          union {
            __IO uint16_t MAR9HH;
            struct {
              __IO uint8_t MAR9HHL;
              __IO uint8_t MAR9HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR9L;
        stc_ethernet_mac_mar9l_field_t MAR9L_f;
        struct {
          union {
            __IO uint16_t MAR9LL;
            struct {
              __IO uint8_t MAR9LLL;
              __IO uint8_t MAR9LLH;
            };
          };
          union {
            __IO uint16_t MAR9LH;
            struct {
              __IO uint8_t MAR9LHL;
              __IO uint8_t MAR9LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR10H;
        stc_ethernet_mac_mar10h_field_t MAR10H_f;
        struct {
          union {
            __IO uint16_t MAR10HL;
            struct {
              __IO uint8_t MAR10HLL;
              __IO uint8_t MAR10HLH;
            };
          };
          union {
            __IO uint16_t MAR10HH;
            struct {
              __IO uint8_t MAR10HHL;
              __IO uint8_t MAR10HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR10L;
        stc_ethernet_mac_mar10l_field_t MAR10L_f;
        struct {
          union {
            __IO uint16_t MAR10LL;
            struct {
              __IO uint8_t MAR10LLL;
              __IO uint8_t MAR10LLH;
            };
          };
          union {
            __IO uint16_t MAR10LH;
            struct {
              __IO uint8_t MAR10LHL;
              __IO uint8_t MAR10LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR11H;
        stc_ethernet_mac_mar11h_field_t MAR11H_f;
        struct {
          union {
            __IO uint16_t MAR11HL;
            struct {
              __IO uint8_t MAR11HLL;
              __IO uint8_t MAR11HLH;
            };
          };
          union {
            __IO uint16_t MAR11HH;
            struct {
              __IO uint8_t MAR11HHL;
              __IO uint8_t MAR11HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR11L;
        stc_ethernet_mac_mar11l_field_t MAR11L_f;
        struct {
          union {
            __IO uint16_t MAR11LL;
            struct {
              __IO uint8_t MAR11LLL;
              __IO uint8_t MAR11LLH;
            };
          };
          union {
            __IO uint16_t MAR11LH;
            struct {
              __IO uint8_t MAR11LHL;
              __IO uint8_t MAR11LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR12H;
        stc_ethernet_mac_mar12h_field_t MAR12H_f;
        struct {
          union {
            __IO uint16_t MAR12HL;
            struct {
              __IO uint8_t MAR12HLL;
              __IO uint8_t MAR12HLH;
            };
          };
          union {
            __IO uint16_t MAR12HH;
            struct {
              __IO uint8_t MAR12HHL;
              __IO uint8_t MAR12HHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR12L;
        stc_ethernet_mac_mar12l_field_t MAR12L_f;
        struct {
          union {
            __IO uint16_t MAR12LL;
            struct {
              __IO uint8_t MAR12LLL;
              __IO uint8_t MAR12LLH;
            };
          };
          union {
            __IO uint16_t MAR12LH;
            struct {
              __IO uint8_t MAR12LHL;
              __IO uint8_t MAR12LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MAR13H;
        stc_ethernet_mac_mar13h_field_t MAR13H_f;
        struct {
          union {
            __IO uint16_t MAR13HL;
            struct {
              __IO uint8_t MAR13HLL;
              __IO uint8_t MAR13HLH;
