mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xl/common/s6e2c2xl.h
/*******************************************************************************
* BT Registers BT12
*   Register Definition
*******************************************************************************/
#define FM_BT12_PPG_PRLL                          *((volatile uint16_t*)(0x40025600UL))
#define FM4_BT12_PPG_PRLL                         *((volatile uint16_t*)(0x40025600UL))
#define FM_BT12_PWM_PCSR                          *((volatile uint16_t*)(0x40025600UL))
#define FM4_BT12_PWM_PCSR                         *((volatile uint16_t*)(0x40025600UL))
#define FM_BT12_RT_PCSR                           *((volatile uint16_t*)(0x40025600UL))
#define FM4_BT12_RT_PCSR                          *((volatile uint16_t*)(0x40025600UL))
#define FM_BT12_PPG_PRLH                          *((volatile uint16_t*)(0x40025604UL))
#define FM4_BT12_PPG_PRLH                         *((volatile uint16_t*)(0x40025604UL))
#define FM_BT12_PWC_DTBF                          *((volatile uint16_t*)(0x40025604UL))
#define FM4_BT12_PWC_DTBF                         *((volatile uint16_t*)(0x40025604UL))
#define FM_BT12_PWM_PDUT                          *((volatile uint16_t*)(0x40025604UL))
#define FM4_BT12_PWM_PDUT                         *((volatile uint16_t*)(0x40025604UL))
#define FM_BT12_PPG_TMR                           *((volatile uint16_t*)(0x40025608UL))
#define FM4_BT12_PPG_TMR                          *((volatile uint16_t*)(0x40025608UL))
#define FM_BT12_PWM_TMR                           *((volatile uint16_t*)(0x40025608UL))
#define FM4_BT12_PWM_TMR                          *((volatile uint16_t*)(0x40025608UL))
#define FM_BT12_RT_TMR                            *((volatile uint16_t*)(0x40025608UL))
#define FM4_BT12_RT_TMR                           *((volatile uint16_t*)(0x40025608UL))
#define FM_BT12_PPG_TMCR                          *((volatile uint16_t*)(0x4002560CUL))
#define FM4_BT12_PPG_TMCR                         *((volatile uint16_t*)(0x4002560CUL))
#define FM_BT12_PWC_TMCR                          *((volatile uint16_t*)(0x4002560CUL))
#define FM4_BT12_PWC_TMCR                         *((volatile uint16_t*)(0x4002560CUL))
#define FM_BT12_PWM_TMCR                          *((volatile uint16_t*)(0x4002560CUL))
#define FM4_BT12_PWM_TMCR                         *((volatile uint16_t*)(0x4002560CUL))
#define FM_BT12_RT_TMCR                           *((volatile uint16_t*)(0x4002560CUL))
#define FM4_BT12_RT_TMCR                          *((volatile uint16_t*)(0x4002560CUL))
#define FM_BT12_PPG_STC                           *((volatile  uint8_t*)(0x40025610UL))
#define FM4_BT12_PPG_STC                          *((volatile  uint8_t*)(0x40025610UL))
#define FM_BT12_PWC_STC                           *((volatile  uint8_t*)(0x40025610UL))
#define FM4_BT12_PWC_STC                          *((volatile  uint8_t*)(0x40025610UL))
#define FM_BT12_PWM_STC                           *((volatile  uint8_t*)(0x40025610UL))
#define FM4_BT12_PWM_STC                          *((volatile  uint8_t*)(0x40025610UL))
#define FM_BT12_RT_STC                            *((volatile  uint8_t*)(0x40025610UL))
#define FM4_BT12_RT_STC                           *((volatile  uint8_t*)(0x40025610UL))
#define FM_BT12_PPG_TMCR2                         *((volatile  uint8_t*)(0x40025611UL))
#define FM4_BT12_PPG_TMCR2                        *((volatile  uint8_t*)(0x40025611UL))
#define FM_BT12_PWC_TMCR2                         *((volatile  uint8_t*)(0x40025611UL))
#define FM4_BT12_PWC_TMCR2                        *((volatile  uint8_t*)(0x40025611UL))
#define FM_BT12_PWM_TMCR2                         *((volatile  uint8_t*)(0x40025611UL))
#define FM4_BT12_PWM_TMCR2                        *((volatile  uint8_t*)(0x40025611UL))
#define FM_BT12_RT_TMCR2                          *((volatile  uint8_t*)(0x40025611UL))
#define FM4_BT12_RT_TMCR2                         *((volatile  uint8_t*)(0x40025611UL))

/*******************************************************************************
* BT Registers BT13
*   Register Definition
*******************************************************************************/
#define FM_BT13_PPG_PRLL                          *((volatile uint16_t*)(0x40025640UL))
#define FM4_BT13_PPG_PRLL                         *((volatile uint16_t*)(0x40025640UL))
#define FM_BT13_PWM_PCSR                          *((volatile uint16_t*)(0x40025640UL))
#define FM4_BT13_PWM_PCSR                         *((volatile uint16_t*)(0x40025640UL))
#define FM_BT13_RT_PCSR                           *((volatile uint16_t*)(0x40025640UL))
#define FM4_BT13_RT_PCSR                          *((volatile uint16_t*)(0x40025640UL))
#define FM_BT13_PPG_PRLH                          *((volatile uint16_t*)(0x40025644UL))
#define FM4_BT13_PPG_PRLH                         *((volatile uint16_t*)(0x40025644UL))
#define FM_BT13_PWC_DTBF                          *((volatile uint16_t*)(0x40025644UL))
#define FM4_BT13_PWC_DTBF                         *((volatile uint16_t*)(0x40025644UL))
#define FM_BT13_PWM_PDUT                          *((volatile uint16_t*)(0x40025644UL))
#define FM4_BT13_PWM_PDUT                         *((volatile uint16_t*)(0x40025644UL))
#define FM_BT13_PPG_TMR                           *((volatile uint16_t*)(0x40025648UL))
#define FM4_BT13_PPG_TMR                          *((volatile uint16_t*)(0x40025648UL))
#define FM_BT13_PWM_TMR                           *((volatile uint16_t*)(0x40025648UL))
#define FM4_BT13_PWM_TMR                          *((volatile uint16_t*)(0x40025648UL))
#define FM_BT13_RT_TMR                            *((volatile uint16_t*)(0x40025648UL))
#define FM4_BT13_RT_TMR                           *((volatile uint16_t*)(0x40025648UL))
#define FM_BT13_PPG_TMCR                          *((volatile uint16_t*)(0x4002564CUL))
#define FM4_BT13_PPG_TMCR                         *((volatile uint16_t*)(0x4002564CUL))
#define FM_BT13_PWC_TMCR                          *((volatile uint16_t*)(0x4002564CUL))
#define FM4_BT13_PWC_TMCR                         *((volatile uint16_t*)(0x4002564CUL))
#define FM_BT13_PWM_TMCR                          *((volatile uint16_t*)(0x4002564CUL))
#define FM4_BT13_PWM_TMCR                         *((volatile uint16_t*)(0x4002564CUL))
#define FM_BT13_RT_TMCR                           *((volatile uint16_t*)(0x4002564CUL))
#define FM4_BT13_RT_TMCR                          *((volatile uint16_t*)(0x4002564CUL))
#define FM_BT13_PPG_STC                           *((volatile  uint8_t*)(0x40025650UL))
#define FM4_BT13_PPG_STC                          *((volatile  uint8_t*)(0x40025650UL))
#define FM_BT13_PWC_STC                           *((volatile  uint8_t*)(0x40025650UL))
#define FM4_BT13_PWC_STC                          *((volatile  uint8_t*)(0x40025650UL))
#define FM_BT13_PWM_STC                           *((volatile  uint8_t*)(0x40025650UL))
#define FM4_BT13_PWM_STC                          *((volatile  uint8_t*)(0x40025650UL))
#define FM_BT13_RT_STC                            *((volatile  uint8_t*)(0x40025650UL))
#define FM4_BT13_RT_STC                           *((volatile  uint8_t*)(0x40025650UL))
#define FM_BT13_PPG_TMCR2                         *((volatile  uint8_t*)(0x40025651UL))
#define FM4_BT13_PPG_TMCR2                        *((volatile  uint8_t*)(0x40025651UL))
#define FM_BT13_PWC_TMCR2                         *((volatile  uint8_t*)(0x40025651UL))
#define FM4_BT13_PWC_TMCR2                        *((volatile  uint8_t*)(0x40025651UL))
#define FM_BT13_PWM_TMCR2                         *((volatile  uint8_t*)(0x40025651UL))
#define FM4_BT13_PWM_TMCR2                        *((volatile  uint8_t*)(0x40025651UL))
#define FM_BT13_RT_TMCR2                          *((volatile  uint8_t*)(0x40025651UL))
#define FM4_BT13_RT_TMCR2                         *((volatile  uint8_t*)(0x40025651UL))

