mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xl/common/s6e2c2xl.h
/*******************************************************************************
* DT Registers DT
*   Bitband Section
*******************************************************************************/
#define bFM_DT_TIMER1CONTROL_ONESHOT              *((volatile  uint32_t*)(0x422A0100UL))
#define bFM4_DT_TIMER1CONTROL_ONESHOT             *((volatile  uint32_t*)(0x422A0100UL))
#define bFM_DT_TIMER1CONTROL_TIMERSIZE            *((volatile  uint32_t*)(0x422A0104UL))
#define bFM4_DT_TIMER1CONTROL_TIMERSIZE           *((volatile  uint32_t*)(0x422A0104UL))
#define bFM_DT_TIMER1CONTROL_INTENABLE            *((volatile  uint32_t*)(0x422A0114UL))
#define bFM4_DT_TIMER1CONTROL_INTENABLE           *((volatile  uint32_t*)(0x422A0114UL))
#define bFM_DT_TIMER1CONTROL_TIMERMODE            *((volatile  uint32_t*)(0x422A0118UL))
#define bFM4_DT_TIMER1CONTROL_TIMERMODE           *((volatile  uint32_t*)(0x422A0118UL))
#define bFM_DT_TIMER1CONTROL_TIMEREN              *((volatile  uint32_t*)(0x422A011CUL))
#define bFM4_DT_TIMER1CONTROL_TIMEREN             *((volatile  uint32_t*)(0x422A011CUL))

#define bFM_DT_TIMER1MIS_TIMER1MIS                *((volatile  uint32_t*)(0x422A0280UL))
#define bFM4_DT_TIMER1MIS_TIMER1MIS               *((volatile  uint32_t*)(0x422A0280UL))

#define bFM_DT_TIMER1RIS_TIMER1RIS                *((volatile  uint32_t*)(0x422A0200UL))
#define bFM4_DT_TIMER1RIS_TIMER1RIS               *((volatile  uint32_t*)(0x422A0200UL))

#define bFM_DT_TIMER2CONTROL_ONESHOT              *((volatile  uint32_t*)(0x422A0500UL))
#define bFM4_DT_TIMER2CONTROL_ONESHOT             *((volatile  uint32_t*)(0x422A0500UL))
#define bFM_DT_TIMER2CONTROL_TIMERSIZE            *((volatile  uint32_t*)(0x422A0504UL))
#define bFM4_DT_TIMER2CONTROL_TIMERSIZE           *((volatile  uint32_t*)(0x422A0504UL))
#define bFM_DT_TIMER2CONTROL_INTENABLE            *((volatile  uint32_t*)(0x422A0514UL))
#define bFM4_DT_TIMER2CONTROL_INTENABLE           *((volatile  uint32_t*)(0x422A0514UL))
#define bFM_DT_TIMER2CONTROL_TIMERMODE            *((volatile  uint32_t*)(0x422A0518UL))
#define bFM4_DT_TIMER2CONTROL_TIMERMODE           *((volatile  uint32_t*)(0x422A0518UL))
#define bFM_DT_TIMER2CONTROL_TIMEREN              *((volatile  uint32_t*)(0x422A051CUL))
#define bFM4_DT_TIMER2CONTROL_TIMEREN             *((volatile  uint32_t*)(0x422A051CUL))

#define bFM_DT_TIMER2MIS_TIMER2MIS                *((volatile  uint32_t*)(0x422A0680UL))
#define bFM4_DT_TIMER2MIS_TIMER2MIS               *((volatile  uint32_t*)(0x422A0680UL))

#define bFM_DT_TIMER2RIS_TIMER2RIS                *((volatile  uint32_t*)(0x422A0600UL))
#define bFM4_DT_TIMER2RIS_TIMER2RIS               *((volatile  uint32_t*)(0x422A0600UL))


/*******************************************************************************
* DUALFLASH_IF Registers DUALFLASH_IF
*   Bitband Section
*******************************************************************************/
#define bFM_DUALFLASH_IF_DFSTR_DFRDY              *((volatile  uint8_t *)(0x42008100UL))
#define bFM4_DUALFLASH_IF_DFSTR_DFRDY             *((volatile  uint8_t *)(0x42008100UL))
#define bFM_DUALFLASH_IF_DFSTR_DFHNG              *((volatile  uint8_t *)(0x42008104UL))
#define bFM4_DUALFLASH_IF_DFSTR_DFHNG             *((volatile  uint8_t *)(0x42008104UL))
#define bFM_DUALFLASH_IF_DFSTR_DFERR              *((volatile  uint8_t *)(0x42008108UL))
#define bFM4_DUALFLASH_IF_DFSTR_DFERR             *((volatile  uint8_t *)(0x42008108UL))


/*******************************************************************************
* ECC_CAPTURE Registers ECC_CAPTURE
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* ETHERNET_CONTROL Registers ETHERNET_CONTROL
*   Bitband Section
*******************************************************************************/
#define bFM_ETHERNET_CONTROL_ETH_MODE_IFMODE      *((volatile  uint8_t *)(0x42CC0000UL))
#define bFM4_ETHERNET_CONTROL_ETH_MODE_IFMODE     *((volatile  uint8_t *)(0x42CC0000UL))
#define bFM_ETHERNET_CONTROL_ETH_MODE_RST0        *((volatile  uint8_t *)(0x42CC0020UL))
#define bFM4_ETHERNET_CONTROL_ETH_MODE_RST0       *((volatile  uint8_t *)(0x42CC0020UL))
#define bFM_ETHERNET_CONTROL_ETH_MODE_RST1        *((volatile  uint8_t *)(0x42CC0024UL))
#define bFM4_ETHERNET_CONTROL_ETH_MODE_RST1       *((volatile  uint8_t *)(0x42CC0024UL))
#define bFM_ETHERNET_CONTROL_ETH_MODE_PPSSEL      *((volatile  uint8_t *)(0x42CC0070UL))
#define bFM4_ETHERNET_CONTROL_ETH_MODE_PPSSEL     *((volatile  uint8_t *)(0x42CC0070UL))


/*******************************************************************************
* ETHERNET_MAC Registers ETHERNET_MAC0
*   Bitband Section
*******************************************************************************/
#define bFM_ETHERNET_MAC0_AHBSR_AHBS              *((volatile  uint8_t *)(0x42CA0580UL))
#define bFM4_ETHERNET_MAC0_AHBSR_AHBS             *((volatile  uint8_t *)(0x42CA0580UL))

#define bFM_ETHERNET_MAC0_BMR_SWR                 *((volatile  uint8_t *)(0x42CA0000UL))
#define bFM4_ETHERNET_MAC0_BMR_SWR                *((volatile  uint8_t *)(0x42CA0000UL))
#define bFM_ETHERNET_MAC0_BMR_DA                  *((volatile  uint8_t *)(0x42CA0004UL))
#define bFM4_ETHERNET_MAC0_BMR_DA                 *((volatile  uint8_t *)(0x42CA0004UL))
#define bFM_ETHERNET_MAC0_BMR_ATDS                *((volatile  uint8_t *)(0x42CA001CUL))
#define bFM4_ETHERNET_MAC0_BMR_ATDS               *((volatile  uint8_t *)(0x42CA001CUL))
#define bFM_ETHERNET_MAC0_BMR_FB                  *((volatile  uint8_t *)(0x42CA0040UL))
#define bFM4_ETHERNET_MAC0_BMR_FB                 *((volatile  uint8_t *)(0x42CA0040UL))
#define bFM_ETHERNET_MAC0_BMR_USP                 *((volatile  uint8_t *)(0x42CA005CUL))
#define bFM4_ETHERNET_MAC0_BMR_USP                *((volatile  uint8_t *)(0x42CA005CUL))
#define bFM_ETHERNET_MAC0_BMR__8XPBL              *((volatile  uint8_t *)(0x42CA0060UL))
#define bFM4_ETHERNET_MAC0_BMR__8XPBL             *((volatile  uint8_t *)(0x42CA0060UL))
#define bFM_ETHERNET_MAC0_BMR_AAL                 *((volatile  uint8_t *)(0x42CA0064UL))
#define bFM4_ETHERNET_MAC0_BMR_AAL                *((volatile  uint8_t *)(0x42CA0064UL))
#define bFM_ETHERNET_MAC0_BMR_MB                  *((volatile  uint8_t *)(0x42CA0068UL))
#define bFM4_ETHERNET_MAC0_BMR_MB                 *((volatile  uint8_t *)(0x42CA0068UL))
#define bFM_ETHERNET_MAC0_BMR_TXPR                *((volatile  uint8_t *)(0x42CA006CUL))
#define bFM4_ETHERNET_MAC0_BMR_TXPR               *((volatile  uint8_t *)(0x42CA006CUL))

#define bFM_ETHERNET_MAC0_FCR_FCB_BPA             *((volatile  uint8_t *)(0x42C80300UL))
#define bFM4_ETHERNET_MAC0_FCR_FCB_BPA            *((volatile  uint8_t *)(0x42C80300UL))
#define bFM_ETHERNET_MAC0_FCR_TFE                 *((volatile  uint8_t *)(0x42C80304UL))
#define bFM4_ETHERNET_MAC0_FCR_TFE                *((volatile  uint8_t *)(0x42C80304UL))
#define bFM_ETHERNET_MAC0_FCR_RFE                 *((volatile  uint8_t *)(0x42C80308UL))
#define bFM4_ETHERNET_MAC0_FCR_RFE                *((volatile  uint8_t *)(0x42C80308UL))
#define bFM_ETHERNET_MAC0_FCR_UP                  *((volatile  uint8_t *)(0x42C8030CUL))
#define bFM4_ETHERNET_MAC0_FCR_UP                 *((volatile  uint8_t *)(0x42C8030CUL))
#define bFM_ETHERNET_MAC0_FCR_DZPQ                *((volatile  uint8_t *)(0x42C8031CUL))
#define bFM4_ETHERNET_MAC0_FCR_DZPQ               *((volatile  uint8_t *)(0x42C8031CUL))

#define bFM_ETHERNET_MAC0_GAR_GB                  *((volatile  uint8_t *)(0x42C80200UL))
#define bFM4_ETHERNET_MAC0_GAR_GB                 *((volatile  uint8_t *)(0x42C80200UL))
#define bFM_ETHERNET_MAC0_GAR_GW                  *((volatile  uint8_t *)(0x42C80204UL))
#define bFM4_ETHERNET_MAC0_GAR_GW                 *((volatile  uint8_t *)(0x42C80204UL))

#define bFM_ETHERNET_MAC0_IER_TIE                 *((volatile  uint8_t *)(0x42CA0380UL))
#define bFM4_ETHERNET_MAC0_IER_TIE                *((volatile  uint8_t *)(0x42CA0380UL))
#define bFM_ETHERNET_MAC0_IER_TSE                 *((volatile  uint8_t *)(0x42CA0384UL))
#define bFM4_ETHERNET_MAC0_IER_TSE                *((volatile  uint8_t *)(0x42CA0384UL))
#define bFM_ETHERNET_MAC0_IER_TUE                 *((volatile  uint8_t *)(0x42CA0388UL))
#define bFM4_ETHERNET_MAC0_IER_TUE                *((volatile  uint8_t *)(0x42CA0388UL))
#define bFM_ETHERNET_MAC0_IER_TJE                 *((volatile  uint8_t *)(0x42CA038CUL))
#define bFM4_ETHERNET_MAC0_IER_TJE                *((volatile  uint8_t *)(0x42CA038CUL))
#define bFM_ETHERNET_MAC0_IER_OVE                 *((volatile  uint8_t *)(0x42CA0390UL))
#define bFM4_ETHERNET_MAC0_IER_OVE                *((volatile  uint8_t *)(0x42CA0390UL))
#define bFM_ETHERNET_MAC0_IER_UNE                 *((volatile  uint8_t *)(0x42CA0394UL))
#define bFM4_ETHERNET_MAC0_IER_UNE                *((volatile  uint8_t *)(0x42CA0394UL))
#define bFM_ETHERNET_MAC0_IER_RIE                 *((volatile  uint8_t *)(0x42CA0398UL))
#define bFM4_ETHERNET_MAC0_IER_RIE                *((volatile  uint8_t *)(0x42CA0398UL))
#define bFM_ETHERNET_MAC0_IER_RUE                 *((volatile  uint8_t *)(0x42CA039CUL))
#define bFM4_ETHERNET_MAC0_IER_RUE                *((volatile  uint8_t *)(0x42CA039CUL))
#define bFM_ETHERNET_MAC0_IER_RSE                 *((volatile  uint8_t *)(0x42CA03A0UL))
#define bFM4_ETHERNET_MAC0_IER_RSE                *((volatile  uint8_t *)(0x42CA03A0UL))
#define bFM_ETHERNET_MAC0_IER_RWE                 *((volatile  uint8_t *)(0x42CA03A4UL))
#define bFM4_ETHERNET_MAC0_IER_RWE                *((volatile  uint8_t *)(0x42CA03A4UL))
#define bFM_ETHERNET_MAC0_IER_ETE                 *((volatile  uint8_t *)(0x42CA03A8UL))
#define bFM4_ETHERNET_MAC0_IER_ETE                *((volatile  uint8_t *)(0x42CA03A8UL))
#define bFM_ETHERNET_MAC0_IER_FBE                 *((volatile  uint8_t *)(0x42CA03B4UL))
#define bFM4_ETHERNET_MAC0_IER_FBE                *((volatile  uint8_t *)(0x42CA03B4UL))
#define bFM_ETHERNET_MAC0_IER_ERE                 *((volatile  uint8_t *)(0x42CA03B8UL))
#define bFM4_ETHERNET_MAC0_IER_ERE                *((volatile  uint8_t *)(0x42CA03B8UL))
#define bFM_ETHERNET_MAC0_IER_AIE                 *((volatile  uint8_t *)(0x42CA03BCUL))
#define bFM4_ETHERNET_MAC0_IER_AIE                *((volatile  uint8_t *)(0x42CA03BCUL))
#define bFM_ETHERNET_MAC0_IER_NIE                 *((volatile  uint8_t *)(0x42CA03C0UL))
#define bFM4_ETHERNET_MAC0_IER_NIE                *((volatile  uint8_t *)(0x42CA03C0UL))

