mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xl/common/s6e2c2xl.h
#define bFM_ETHERNET_MAC0_MAR5H_SA                *((volatile  uint8_t *)(0x42C80D78UL))
#define bFM4_ETHERNET_MAC0_MAR5H_SA               *((volatile  uint8_t *)(0x42C80D78UL))
#define bFM_ETHERNET_MAC0_MAR5H_AE                *((volatile  uint8_t *)(0x42C80D7CUL))
#define bFM4_ETHERNET_MAC0_MAR5H_AE               *((volatile  uint8_t *)(0x42C80D7CUL))

#define bFM_ETHERNET_MAC0_MAR6H_SA                *((volatile  uint8_t *)(0x42C80E78UL))
#define bFM4_ETHERNET_MAC0_MAR6H_SA               *((volatile  uint8_t *)(0x42C80E78UL))
#define bFM_ETHERNET_MAC0_MAR6H_AE                *((volatile  uint8_t *)(0x42C80E7CUL))
#define bFM4_ETHERNET_MAC0_MAR6H_AE               *((volatile  uint8_t *)(0x42C80E7CUL))

#define bFM_ETHERNET_MAC0_MAR7H_SA                *((volatile  uint8_t *)(0x42C80F78UL))
#define bFM4_ETHERNET_MAC0_MAR7H_SA               *((volatile  uint8_t *)(0x42C80F78UL))
#define bFM_ETHERNET_MAC0_MAR7H_AE                *((volatile  uint8_t *)(0x42C80F7CUL))
#define bFM4_ETHERNET_MAC0_MAR7H_AE               *((volatile  uint8_t *)(0x42C80F7CUL))

#define bFM_ETHERNET_MAC0_MAR8H_SA                *((volatile  uint8_t *)(0x42C81078UL))
#define bFM4_ETHERNET_MAC0_MAR8H_SA               *((volatile  uint8_t *)(0x42C81078UL))
#define bFM_ETHERNET_MAC0_MAR8H_AE                *((volatile  uint8_t *)(0x42C8107CUL))
#define bFM4_ETHERNET_MAC0_MAR8H_AE               *((volatile  uint8_t *)(0x42C8107CUL))

#define bFM_ETHERNET_MAC0_MAR9H_SA                *((volatile  uint8_t *)(0x42C81178UL))
#define bFM4_ETHERNET_MAC0_MAR9H_SA               *((volatile  uint8_t *)(0x42C81178UL))
#define bFM_ETHERNET_MAC0_MAR9H_AE                *((volatile  uint8_t *)(0x42C8117CUL))
#define bFM4_ETHERNET_MAC0_MAR9H_AE               *((volatile  uint8_t *)(0x42C8117CUL))

#define bFM_ETHERNET_MAC0_MCR_RE                  *((volatile  uint8_t *)(0x42C80008UL))
#define bFM4_ETHERNET_MAC0_MCR_RE                 *((volatile  uint8_t *)(0x42C80008UL))
#define bFM_ETHERNET_MAC0_MCR_TE                  *((volatile  uint8_t *)(0x42C8000CUL))
#define bFM4_ETHERNET_MAC0_MCR_TE                 *((volatile  uint8_t *)(0x42C8000CUL))
#define bFM_ETHERNET_MAC0_MCR_DC                  *((volatile  uint8_t *)(0x42C80010UL))
#define bFM4_ETHERNET_MAC0_MCR_DC                 *((volatile  uint8_t *)(0x42C80010UL))
#define bFM_ETHERNET_MAC0_MCR_ACS                 *((volatile  uint8_t *)(0x42C8001CUL))
#define bFM4_ETHERNET_MAC0_MCR_ACS                *((volatile  uint8_t *)(0x42C8001CUL))
#define bFM_ETHERNET_MAC0_MCR_LUD                 *((volatile  uint8_t *)(0x42C80020UL))
#define bFM4_ETHERNET_MAC0_MCR_LUD                *((volatile  uint8_t *)(0x42C80020UL))
#define bFM_ETHERNET_MAC0_MCR_DR                  *((volatile  uint8_t *)(0x42C80024UL))
#define bFM4_ETHERNET_MAC0_MCR_DR                 *((volatile  uint8_t *)(0x42C80024UL))
#define bFM_ETHERNET_MAC0_MCR_IPC                 *((volatile  uint8_t *)(0x42C80028UL))
#define bFM4_ETHERNET_MAC0_MCR_IPC                *((volatile  uint8_t *)(0x42C80028UL))
#define bFM_ETHERNET_MAC0_MCR_DM                  *((volatile  uint8_t *)(0x42C8002CUL))
#define bFM4_ETHERNET_MAC0_MCR_DM                 *((volatile  uint8_t *)(0x42C8002CUL))
#define bFM_ETHERNET_MAC0_MCR_LM                  *((volatile  uint8_t *)(0x42C80030UL))
#define bFM4_ETHERNET_MAC0_MCR_LM                 *((volatile  uint8_t *)(0x42C80030UL))
#define bFM_ETHERNET_MAC0_MCR_DO                  *((volatile  uint8_t *)(0x42C80034UL))
#define bFM4_ETHERNET_MAC0_MCR_DO                 *((volatile  uint8_t *)(0x42C80034UL))
#define bFM_ETHERNET_MAC0_MCR_FES                 *((volatile  uint8_t *)(0x42C80038UL))
#define bFM4_ETHERNET_MAC0_MCR_FES                *((volatile  uint8_t *)(0x42C80038UL))
#define bFM_ETHERNET_MAC0_MCR_PS                  *((volatile  uint8_t *)(0x42C8003CUL))
#define bFM4_ETHERNET_MAC0_MCR_PS                 *((volatile  uint8_t *)(0x42C8003CUL))
#define bFM_ETHERNET_MAC0_MCR_DCRS                *((volatile  uint8_t *)(0x42C80040UL))
#define bFM4_ETHERNET_MAC0_MCR_DCRS               *((volatile  uint8_t *)(0x42C80040UL))
#define bFM_ETHERNET_MAC0_MCR_JE                  *((volatile  uint8_t *)(0x42C80050UL))
#define bFM4_ETHERNET_MAC0_MCR_JE                 *((volatile  uint8_t *)(0x42C80050UL))
#define bFM_ETHERNET_MAC0_MCR_BE                  *((volatile  uint8_t *)(0x42C80054UL))
#define bFM4_ETHERNET_MAC0_MCR_BE                 *((volatile  uint8_t *)(0x42C80054UL))
#define bFM_ETHERNET_MAC0_MCR_JD                  *((volatile  uint8_t *)(0x42C80058UL))
#define bFM4_ETHERNET_MAC0_MCR_JD                 *((volatile  uint8_t *)(0x42C80058UL))
#define bFM_ETHERNET_MAC0_MCR_WD                  *((volatile  uint8_t *)(0x42C8005CUL))
#define bFM4_ETHERNET_MAC0_MCR_WD                 *((volatile  uint8_t *)(0x42C8005CUL))
#define bFM_ETHERNET_MAC0_MCR_TC                  *((volatile  uint8_t *)(0x42C80060UL))
#define bFM4_ETHERNET_MAC0_MCR_TC                 *((volatile  uint8_t *)(0x42C80060UL))
#define bFM_ETHERNET_MAC0_MCR_CST                 *((volatile  uint8_t *)(0x42C80064UL))
#define bFM4_ETHERNET_MAC0_MCR_CST                *((volatile  uint8_t *)(0x42C80064UL))

#define bFM_ETHERNET_MAC0_MFBOCR_ONMFH            *((volatile  uint8_t *)(0x42CA0440UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_ONMFH           *((volatile  uint8_t *)(0x42CA0440UL))
#define bFM_ETHERNET_MAC0_MFBOCR_ONMFF            *((volatile  uint8_t *)(0x42CA0470UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_ONMFF           *((volatile  uint8_t *)(0x42CA0470UL))

#define bFM_ETHERNET_MAC0_MFFR_PR                 *((volatile  uint8_t *)(0x42C80080UL))
#define bFM4_ETHERNET_MAC0_MFFR_PR                *((volatile  uint8_t *)(0x42C80080UL))
#define bFM_ETHERNET_MAC0_MFFR_HUC                *((volatile  uint8_t *)(0x42C80084UL))
#define bFM4_ETHERNET_MAC0_MFFR_HUC               *((volatile  uint8_t *)(0x42C80084UL))
#define bFM_ETHERNET_MAC0_MFFR_HMC                *((volatile  uint8_t *)(0x42C80088UL))
#define bFM4_ETHERNET_MAC0_MFFR_HMC               *((volatile  uint8_t *)(0x42C80088UL))
#define bFM_ETHERNET_MAC0_MFFR_DAIF               *((volatile  uint8_t *)(0x42C8008CUL))
#define bFM4_ETHERNET_MAC0_MFFR_DAIF              *((volatile  uint8_t *)(0x42C8008CUL))
#define bFM_ETHERNET_MAC0_MFFR_PM                 *((volatile  uint8_t *)(0x42C80090UL))
#define bFM4_ETHERNET_MAC0_MFFR_PM                *((volatile  uint8_t *)(0x42C80090UL))
#define bFM_ETHERNET_MAC0_MFFR_DB                 *((volatile  uint8_t *)(0x42C80094UL))
#define bFM4_ETHERNET_MAC0_MFFR_DB                *((volatile  uint8_t *)(0x42C80094UL))
#define bFM_ETHERNET_MAC0_MFFR_SAIF               *((volatile  uint8_t *)(0x42C800A0UL))
#define bFM4_ETHERNET_MAC0_MFFR_SAIF              *((volatile  uint8_t *)(0x42C800A0UL))
#define bFM_ETHERNET_MAC0_MFFR_SAF                *((volatile  uint8_t *)(0x42C800A4UL))
#define bFM4_ETHERNET_MAC0_MFFR_SAF               *((volatile  uint8_t *)(0x42C800A4UL))
#define bFM_ETHERNET_MAC0_MFFR_HPF                *((volatile  uint8_t *)(0x42C800A8UL))
#define bFM4_ETHERNET_MAC0_MFFR_HPF               *((volatile  uint8_t *)(0x42C800A8UL))
#define bFM_ETHERNET_MAC0_MFFR_RA                 *((volatile  uint8_t *)(0x42C800FCUL))
#define bFM4_ETHERNET_MAC0_MFFR_RA                *((volatile  uint8_t *)(0x42C800FCUL))

#define bFM_ETHERNET_MAC0_OMR_SR                  *((volatile  uint8_t *)(0x42CA0304UL))
#define bFM4_ETHERNET_MAC0_OMR_SR                 *((volatile  uint8_t *)(0x42CA0304UL))
#define bFM_ETHERNET_MAC0_OMR_OSF                 *((volatile  uint8_t *)(0x42CA0308UL))
#define bFM4_ETHERNET_MAC0_OMR_OSF                *((volatile  uint8_t *)(0x42CA0308UL))
#define bFM_ETHERNET_MAC0_OMR_FUF                 *((volatile  uint8_t *)(0x42CA0318UL))
#define bFM4_ETHERNET_MAC0_OMR_FUF                *((volatile  uint8_t *)(0x42CA0318UL))
#define bFM_ETHERNET_MAC0_OMR_FEF                 *((volatile  uint8_t *)(0x42CA031CUL))
#define bFM4_ETHERNET_MAC0_OMR_FEF                *((volatile  uint8_t *)(0x42CA031CUL))
#define bFM_ETHERNET_MAC0_OMR_ST                  *((volatile  uint8_t *)(0x42CA0334UL))
#define bFM4_ETHERNET_MAC0_OMR_ST                 *((volatile  uint8_t *)(0x42CA0334UL))
#define bFM_ETHERNET_MAC0_OMR_FTF                 *((volatile  uint8_t *)(0x42CA0350UL))
#define bFM4_ETHERNET_MAC0_OMR_FTF                *((volatile  uint8_t *)(0x42CA0350UL))
#define bFM_ETHERNET_MAC0_OMR_TSF                 *((volatile  uint8_t *)(0x42CA0354UL))
#define bFM4_ETHERNET_MAC0_OMR_TSF                *((volatile  uint8_t *)(0x42CA0354UL))
#define bFM_ETHERNET_MAC0_OMR_DFF                 *((volatile  uint8_t *)(0x42CA0360UL))
#define bFM4_ETHERNET_MAC0_OMR_DFF                *((volatile  uint8_t *)(0x42CA0360UL))
#define bFM_ETHERNET_MAC0_OMR_RSF                 *((volatile  uint8_t *)(0x42CA0364UL))
#define bFM4_ETHERNET_MAC0_OMR_RSF                *((volatile  uint8_t *)(0x42CA0364UL))
#define bFM_ETHERNET_MAC0_OMR_DT                  *((volatile  uint8_t *)(0x42CA0368UL))
#define bFM4_ETHERNET_MAC0_OMR_DT                 *((volatile  uint8_t *)(0x42CA0368UL))

#define bFM_ETHERNET_MAC0_PMTR_PD                 *((volatile  uint8_t *)(0x42C80580UL))
#define bFM4_ETHERNET_MAC0_PMTR_PD                *((volatile  uint8_t *)(0x42C80580UL))
#define bFM_ETHERNET_MAC0_PMTR_MPE                *((volatile  uint8_t *)(0x42C80584UL))
#define bFM4_ETHERNET_MAC0_PMTR_MPE               *((volatile  uint8_t *)(0x42C80584UL))
#define bFM_ETHERNET_MAC0_PMTR_WFE                *((volatile  uint8_t *)(0x42C80588UL))
#define bFM4_ETHERNET_MAC0_PMTR_WFE               *((volatile  uint8_t *)(0x42C80588UL))
#define bFM_ETHERNET_MAC0_PMTR_MPR                *((volatile  uint8_t *)(0x42C80594UL))
#define bFM4_ETHERNET_MAC0_PMTR_MPR               *((volatile  uint8_t *)(0x42C80594UL))
#define bFM_ETHERNET_MAC0_PMTR_WPR                *((volatile  uint8_t *)(0x42C80598UL))
#define bFM4_ETHERNET_MAC0_PMTR_WPR               *((volatile  uint8_t *)(0x42C80598UL))
#define bFM_ETHERNET_MAC0_PMTR_GU                 *((volatile  uint8_t *)(0x42C805A4UL))
#define bFM4_ETHERNET_MAC0_PMTR_GU                *((volatile  uint8_t *)(0x42C805A4UL))
#define bFM_ETHERNET_MAC0_PMTR_RWFFRPR            *((volatile  uint8_t *)(0x42C805FCUL))
#define bFM4_ETHERNET_MAC0_PMTR_RWFFRPR           *((volatile  uint8_t *)(0x42C805FCUL))

